#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "77b7d61b5d3fa5da1efbddf88c89d6a7" -> "13d861af6e11608c147996fb2146ae7c"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "fe67e98fd56df7809f42e62c857e9c45" -> "99d8011f9ce7765b0051f27588e3b4b2"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "d92badc46a72a70bccbd2a63615da7a9" -> "94e4718dbe33ada707c480199f7ac33c"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "496bb5ff0d6d0190aa7d08b8b286e595" -> "856718f1c020d9e95df0e9a081ffd3be"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "8d5d7db537957f6e608027f9a750856c" -> "959c0e37ea4b276746726c29ee0edf3e"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "909f631609415403e4546365b19ed7b9" -> "6f8955862957d6e4f21d34e7c1cb18bb"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "1175eb3c563494fd26c478d2cb9a8c80" -> "832b2c64b2613834c0fbf4ba13d60acf"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "8d69000297b9b6566af01390d6430f1c" -> "ecb6cf0a8b570e9b771ef00463683c87"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "6e21e1588b6ea6846950e1d06ace9a2d" -> "bd742b246342de4b959604b3511b679b"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "1ca1192b5c43d21f878e9c04473be7aa" -> "8586cd2ed8600678e9ef265e9448d12a"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "e1a59f70691d963ffe2d4e553471316d" -> "6537299314dc90274f0dda0d7fd60ef4"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "291f547c128dd74bad658c9553d60740" -> "9d150816c4463e7b6cf333dc3aa9e4d1"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "a452bbc1d22ea2f143e76c61e9603d85" -> "23f398186082b94740c65b75c87cea76"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "c58b1e062af99d900ac68c602bc74d4d" -> "d953d07e0c2e3ae3acd54f5a574c77dc"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "730953baf5285df9cf1cb27a37098fa9" -> "6e48f7aaa5024e8d91eb9127f240f45d"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be created
  + resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "429abe55ea61d9a39e989ca6a5650303"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/get_all_tags_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/get_all_tags_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "389e35e291dd3fd38a98d2e85283d130" -> "2c5e0392900ae7f999c17b4399d0713d"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "d92622e7d86adad6d7815561c8e4f290" -> "dc8da76ac462ecfeb5ffea288a4d794d"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "ab04c467451bcd8247ba3a48b4c5f7e3" -> "c785b7e989bbae873416f460f7380fb1"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "f660766bd9f45abaff01c8afbd1930fc" -> "7dfa894cdd6337bbb60650f759e2fe48"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "a9f0447e0d48c1543a34c3ca899f00f4" -> "ff8c2d758de3d28fc0ba61a5e9994240"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "16332e3a2ff7cfa8423010719e450c52" -> "a5dd60cf735ac8ba0203af3f96291bff"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "911b4cfe4a492023936c141dd1830313" -> "d06830f3f434b285959d5f8eb1799a7b"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "c9e84d3f23710949be0467813947696c" -> "339b3f1e3a23416813496e1f06741837"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "8acb2b657ce337c32d73f6634c0d8012" -> "430dd2db18c6f4d3883d669fd2acd478"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_year_options_function_object will be destroyed
  # (because aws_s3_bucket_object.get_investment_year_options_function_object is not in configuration)
  - resource "aws_s3_bucket_object" "get_investment_year_options_function_object" {
      - acl                = "private" -> null
      - bucket             = "kpinetwork-backend" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "1fe0e1235f31312c0423e6e151b73100" -> null
      - force_destroy      = false -> null
      - id                 = "lambdas/demo/get_investment_year_options_handler.zip" -> null
      - key                = "lambdas/demo/get_investment_year_options_handler.zip" -> null
      - metadata           = {} -> null
      - source             = "buckets/../../dist/get_investment_year_options_handler.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.buckets.aws_s3_bucket_object.get_investment_year_report_function_object will be destroyed
  # (because aws_s3_bucket_object.get_investment_year_report_function_object is not in configuration)
  - resource "aws_s3_bucket_object" "get_investment_year_report_function_object" {
      - acl                = "private" -> null
      - bucket             = "kpinetwork-backend" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "8a37f6051f84497159f1c246f3318e6d" -> null
      - force_destroy      = false -> null
      - id                 = "lambdas/demo/get_investment_year_report_handler.zip" -> null
      - key                = "lambdas/demo/get_investment_year_report_handler.zip" -> null
      - metadata           = {} -> null
      - source             = "buckets/../../dist/get_investment_year_report_handler.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "d1db49c52d54c4377e3097568f685b90" -> "caaf9e8e543385e9f3d0b4de7b5ded1e"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "51c1b6868ecc10440eb8fab58ee08f73" -> "534fa40612352b557a1345fe6bfbf134"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "a15daac980db0aa106b563e3b929b4a9" -> "0934f95ad2da63e19d7854633d033096"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "182ab50e24f1017e8c2478d0c6744693" -> "8c631335b4dd0252cb2096ee59e3d794"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "548acc51ca918d50471e04ad1626320e" -> "11ef941f360441a9b920a94e2ed40d1b"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "944c8f2d1ab021fab7d51592fb5c420b" -> "3c9e8338115775d495c46787c5e76cb2"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "0b5a9d5e8729b62f9a766a4b7fd44f52" -> "6465b67eafaa53ac4d03edfdfa1a6860"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "fec04bf89294039af7f12cf7d123872e" -> "4ac7f50154ae241c1d222a6816f531b4"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "1fe52fd64010c8b1d135a249d02c0f05" -> "c1054e49ce98b20743582793e60b7615"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "42cdaed161941902bd4735c434dec5e3" -> "9b2d20d5e42e79f23ad5db5fdd744df2"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "53decc18ba4c79b5bc6f83b2a4edfed4" -> "ce58ba46dee5fb5190b4abe2f2619f6a"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "6b0b9216b20c24db0dd7f396320a7bc3" -> "7f2dd9989c3d0ee9f8b4449d8cbbf673"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "91d93bb574f912864d3f9fc920e2fd38" -> "6394fddc043a2b1bd4256e5eb40fd8e5"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "fshoLqWU6fXKFSqWOB9x6qZk20pMfOubg6NLKly5lTI=" -> "pqGB+VxkyglOv1y+k/Wo1B09lX4tdenFtRX7TApNtR4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "7Sqlb907IxeKsx+Nl/wmdAtxw46S8AcNifvelIH+htw=" -> "CWQaU1CAQsf4sySF6QnoekUsVKZIVMugMvAivf9Env0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "CyHUVfcBtKr3RWZ8BOjIM877h8LyTUB8o5x+n7VjaTI=" -> "mwucop1S6owy78/XXACJhatIpHRfMTnEmYuxxOIkAj8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "d3iFPY4h4WLSKz1hdOoGt0hZCZIjrvw8h1CWA7WWn9Y=" -> "tIuexvXt8XPHZFA3LX2+dDNfJmoOmMl6tCJKGWx9xic="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "6TsivgwUC7Er2GPSzyAZ318rDwc5n7529opsxEDynRY=" -> "cCEH1u30Pp7k+MixcEDbvXMtO57OaPy0VIzYTJdhL+E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "RL7QBzCLJ4bW/NuK9P4AiigfgoqAD3wXXLHiDqUxra8=" -> "5JUttaMGTG3QD5OGa8ZJD6CTkpuHL7bcUPxAgKCIooU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "qBzSm5vmhbe88zOo3n8kY/fGkpMkIgqiNcw3a5vU9j8=" -> "HT6ndRRbr5+ZkpgY14yAuRRssCxv/yE4K0Ljh11aWAY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ejl7GDJw9DF/0vlex+gfrRb/Vyp0yfVlEw2XrLaJmXA=" -> "FyWX4THWy6y7g7Llg1CMIBcx5AKTGCd6qfcSo53awPs="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "hwKj55LvbBKyfGjE7UVRMEgWjRzbJ0rBWeW8uM2M4Hk=" -> "MYEdC7XhTcafpHunKY9dNtvNHBeW9SwYDnc872cPvxw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "fmYq/0B8jfdegpydqAH90lDtxFt+Aw+7jweL48ClHdI=" -> "oeOdK5h66ODEexzeZz+vz+ktTno3/tSHdepN3/TBxMg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "RioVkOA9XP5et56zms7g8A23iuTDDiK39Uie6Sjuj9Q=" -> "r7sk6vrzEawwNvvR+BdE98qUcze2r/GR3sm1W6wSXw4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bnv7iUbr1K2H6DXOeB5lqO4LWys9irNSiOVOBC0DOpE=" -> "q5vytdvyIBYCUUiIbofsF6ZUA+OglMGZE0Ro9EejxKk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "HS+0kI9AkoCVw/EjnRQngeoCeQEVZBNbFDjAr3HqO6E=" -> "3eCWzwH+PBJbCrO0PiWxGKbxJH0J0ZpvEiAwAr73ye4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "0F3ULD3wPXNebcyyiSuZQkFnFm/yvOGOBTwF/if1b9U=" -> "meepR5Lo0o4x/cadtTzl32XPy0PXTkrsHZhHS30Rsvg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-03T17:20:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "DSkI3sQRneHheFm9KInHOW3BE5r+gJPAMI2V/bLmiD4=" -> "shi2slSiHd4ymk75sWiEZ0K+kdcHOiW2P8yT44h+T+A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be created
  + resource "aws_lambda_function" "get_all_tags_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_get_all_tags_lambda_function"
      + handler                        = "get_all_tags_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/get_all_tags_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "fUrPqpr6t5QO8BzUXLCMLK69nLWbOFUqh7Z++oe8ZW8="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "+J0R7p9wnt/MFD5diNufPLuxHIQ2zub2chmmoXjgEcg=" -> "LaDxLA3cHT5GEXX8k43lffhHXhpqyT5cnSdGQ1iBgNY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "0k1CRzS3J9MYzkAnMK2GfzK2JUUhOXTO/C1vQhIYCfA=" -> "gFO8Jx6BEDbrVCMrOdVPJKMGuQqxHsejBYg6916xUz8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "yBeuHuFHVzw3XCc5Y34EpB8duxXhdu06a7D2W072vXU=" -> "tHmT3X+nRs0YlWYjr5WohW1mBZTU7agxpQjGLvdIQ1o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "sg6EKq0bxKqDJyIT2aob6+urS34CsqnKvZJg+SGF0IY=" -> "ae8wGX6n6u3dA93v95sidC7vq5pYfkReEZ/RNyHIlkg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "NWzy/Wq5BR3P5OwcoUJoDqKsEq2lIJZkqtsXhyMvsJk=" -> "lwZdyBcRjZEkvD0Ynx0MgsJ5ATlP3xZ4RjZhXGEO28M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "z6kOrmXCir5rdtmCCSCVeDUPeLkQ3fMemN3im+3naSQ=" -> "sAjggGWJa502txlqKvUu5XrCsJR4nw4w7mUvrOvxrCU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "MBrdeAJvwqgzo//jjIQ+E+gDprwbsEPgpro4+uBcv/4=" -> "okzNAWBr2mNwNbRIyK7UoqIFMknH92ZSzK62U7RQPTo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "PF8WAD8Vm3T+eCfT9YEtLXTeLp+tLGZAkR7BXB1bWn8=" -> "3YoSyG1/XYnVAEoWvsOMY15wON+BS7YVxN6N9/FhUnQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "Y9/furq3Rf/najoGfE/silCYRFAJ0J/LxrtBC9kR3/k=" -> "mC+sQcNaOBPMt5Vt4YA+LSbGtmC38YOBFYZJF4qV+b8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_year_options_lambda_function will be destroyed
  # (because aws_lambda_function.get_investment_year_options_lambda_function is not in configuration)
  - resource "aws_lambda_function" "get_investment_year_options_lambda_function" {
      - arn                            = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_investment_year_options_lambda_function" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - function_name                  = "demo_get_investment_year_options_lambda_function" -> null
      - handler                        = "get_investment_year_options_handler.handler" -> null
      - id                             = "demo_get_investment_year_options_lambda_function" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_investment_year_options_lambda_function/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2022-09-30T18:08:57.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_investment_year_options_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::435552912911:role/demo_get_investment_year_options_lambda_exec_role" -> null
      - runtime                        = "python3.8" -> null
      - s3_bucket                      = "kpinetwork-backend" -> null
      - s3_key                         = "lambdas/demo/get_investment_year_options_handler.zip" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "oTq2/u5VImFafUgdNN2Qrqkht87ArqDgZlY1DykUABs=" -> null
      - source_code_size               = 123504 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 100 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "DB_HOST"     = (sensitive)
              - "DB_NAME"     = "demokpinetworkdb"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0bda66e4a9afc62a9",
            ] -> null
          - subnet_ids         = [
              - "subnet-0264422b45299167e",
            ] -> null
          - vpc_id             = "vpc-0f621b75ad71aa17d" -> null
        }
    }

  # module.functions.aws_lambda_function.get_investment_year_report_lambda_function will be destroyed
  # (because aws_lambda_function.get_investment_year_report_lambda_function is not in configuration)
  - resource "aws_lambda_function" "get_investment_year_report_lambda_function" {
      - arn                            = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_investment_year_report_lambda_function" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - function_name                  = "demo_get_investment_year_report_lambda_function" -> null
      - handler                        = "get_investment_year_report_handler.handler" -> null
      - id                             = "demo_get_investment_year_report_lambda_function" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_investment_year_report_lambda_function/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2022-09-30T18:08:55.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_investment_year_report_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::435552912911:role/demo_get_investment_year_report_lambda_exec_role" -> null
      - runtime                        = "python3.8" -> null
      - s3_bucket                      = "kpinetwork-backend" -> null
      - s3_key                         = "lambdas/demo/get_investment_year_report_handler.zip" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "a7XkxkNErA7yU7Ii8ZeDRep0roBcyFnjOeO3V01HR/k=" -> null
      - source_code_size               = 140457 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 100 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "ACCESS_KEY"   = (sensitive)
              - "DB_HOST"      = (sensitive)
              - "DB_NAME"      = "demokpinetworkdb"
              - "DB_PASSWORD"  = (sensitive)
              - "DB_USERNAME"  = (sensitive)
              - "SECRET_KEY"   = (sensitive)
              - "USER_POOL_ID" = "us-west-2_usXw4S12D"
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0bda66e4a9afc62a9",
            ] -> null
          - subnet_ids         = [
              - "subnet-0264422b45299167e",
            ] -> null
          - vpc_id             = "vpc-0f621b75ad71aa17d" -> null
        }
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "eUbzIiXDfIP5JcY4V628uhLOrowKwKvA9T3dpF+gpM4=" -> "ixT4mI47AFhiMg0nZ9mtSY26NHJi3xflXcAUXnp9G9g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "PWmtTI1Qqq/0ZlcsWaILF4Hv3n2FeYkix6jr6/Iqmjc=" -> "FazzIcsCxbGoFgKhcVaoQf5sZY7ysNlPU+0KBVzOinU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZY2DN082UEqRvsEjDfIdQoLiirvWhx8wPjMlFJwOWTg=" -> "ZG3qWHiKuR2IBTQX6cANTLg8CrrgC5h9zlwfmEQ+jZU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "v+jBRSg4XnaLNAIFDHliNCTDtJ2/AwDg+qnzKYR4Crg=" -> "v8YyPKDupTF5ftqlgP7cZ6jdX3VGYd5gXVSEV4kojpc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "IYUxm/27gAbrRsbHaI89Bn9r2zUdlnBXQR4oNiqa5IQ=" -> "HWN7svtV95B1LiwIxBlPfrlTbaPJhUiBoi1CE646M78="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "KIH+2uT8NVcShJIBJI7WJY159jB2AdWl9pptyE+hSKE=" -> "TgpT8Cc1moeroOrX8K/A5qAKJB+oxCCNfYSh+jhEGwo="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "A1erIge4EyF2DfxGslEcZxh4in/wGLBaULhzdEg8U+k=" -> "jgaRoSChZHGRynlkX9BxD8/DKJLuBUKpMHrXH1nI4ZI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "eIJWnn/LPSbZZ5Y7jzyIb0GMjYwhCziFkOPD4nawguI=" -> "jJ/Fq9fMkXO+fq8xX/2lEqnaGUmgQsZx02TTJXA3FAo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "m0fpac0hzJLcqMT4prIwQBfFMK0/z5EKfkLdZWG+xaU=" -> "h68FsIQb+5eZHxBrVILVK6eEMbJZ4A1VnXPswXIxRrU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "RUYl1EAUoFYKT44aI6ECdKpXDpd+0hzQlFx7HpLphfk=" -> "T6IV9aWsa09igfQT/2wYy+cwuHrQdHWTHI//rFFuZ0M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "zQo+vubyBGFAQff/7KOzQziH4ftWhtMxazEyp/GVlgE=" -> "roi7RBkm83S9KiDEv5G9OarWSUsyES5JbhAujnPxHnU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "CFmpo/JVhipKEZ4vC3znB7UtzYk7mnfQpf1BE4mdHTI=" -> "ai8TBTZYhAZkr6zpS/3uMKgi8QiodQntm/T1FX8jYPs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-09-30T18:08:14Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "wdve7j" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-09-30T18:08:13Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.get_all_tags_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_all_tags_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_get_all_tags_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.logs.aws_cloudwatch_log_group.get_investment_year_options_lambda_function will be destroyed
  # (because aws_cloudwatch_log_group.get_investment_year_options_lambda_function is not in configuration)
  - resource "aws_cloudwatch_log_group" "get_investment_year_options_lambda_function" {
      - arn               = "arn:aws:logs:us-west-2:435552912911:log-group:/aws/lambda/demo_get_investment_year_options_lambda_function" -> null
      - id                = "/aws/lambda/demo_get_investment_year_options_lambda_function" -> null
      - name              = "/aws/lambda/demo_get_investment_year_options_lambda_function" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.logs.aws_cloudwatch_log_group.get_investment_year_report_lambda_function will be destroyed
  # (because aws_cloudwatch_log_group.get_investment_year_report_lambda_function is not in configuration)
  - resource "aws_cloudwatch_log_group" "get_investment_year_report_lambda_function" {
      - arn               = "arn:aws:logs:us-west-2:435552912911:log-group:/aws/lambda/demo_get_investment_year_report_lambda_function" -> null
      - id                = "/aws/lambda/demo_get_investment_year_report_lambda_function" -> null
      - name              = "/aws/lambda/demo_get_investment_year_report_lambda_function" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.network.aws_api_gateway_integration.get_all_tags_integration will be created
  + resource "aws_api_gateway_integration" "get_all_tags_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_integration.invest_year_options_integration will be destroyed
  # (because aws_api_gateway_integration.invest_year_options_integration is not in configuration)
  - resource "aws_api_gateway_integration" "invest_year_options_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "gq814s" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb7gblbu69-gq814s-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "gq814s" -> null
      - rest_api_id             = "kb7gblbu69" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_investment_year_options_lambda_function/invocations" -> null
    }

  # module.network.aws_api_gateway_integration.investment_report_integration will be destroyed
  # (because aws_api_gateway_integration.investment_report_integration is not in configuration)
  - resource "aws_api_gateway_integration" "investment_report_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "ieupa8" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb7gblbu69-ieupa8-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "ieupa8" -> null
      - rest_api_id             = "kb7gblbu69" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_investment_year_report_lambda_function/invocations" -> null
    }

  # module.network.aws_api_gateway_method.dynamic_report_method will be updated in-place
  ~ resource "aws_api_gateway_method" "dynamic_report_method" {
        id                   = "agm-kb7gblbu69-1c508f-GET"
      ~ request_parameters   = {
          - "method.request.querystring.investment_year"  = false -> null
            # (8 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_all_tags_method will be created
  + resource "aws_api_gateway_method" "get_all_tags_method" {
      + api_key_required   = false
      + authorization      = "CUSTOM"
      + authorizer_id      = "3y14fs"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.querystring.limit"  = false
          + "method.request.querystring.offset" = false
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_method.get_investment_year_options_method will be destroyed
  # (because aws_api_gateway_method.get_investment_year_options_method is not in configuration)
  - resource "aws_api_gateway_method" "get_investment_year_options_method" {
      - api_key_required     = false -> null
      - authorization        = "CUSTOM" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "3y14fs" -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kb7gblbu69-gq814s-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "gq814s" -> null
      - rest_api_id          = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_method.get_investment_year_report_method will be destroyed
  # (because aws_api_gateway_method.get_investment_year_report_method is not in configuration)
  - resource "aws_api_gateway_method" "get_investment_year_report_method" {
      - api_key_required     = false -> null
      - authorization        = "CUSTOM" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "3y14fs" -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kb7gblbu69-ieupa8-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {
          - "method.request.querystring.from_main"        = false
          - "method.request.querystring.growth_profile"   = false
          - "method.request.querystring.invest_year"      = false
          - "method.request.querystring.investor_profile" = false
          - "method.request.querystring.sector"           = false
          - "method.request.querystring.size"             = false
          - "method.request.querystring.vertical"         = false
        } -> null
      - resource_id          = "ieupa8" -> null
      - rest_api_id          = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_resource.tags will be created
  + resource "aws_api_gateway_resource" "tags" {
      + id          = (known after apply)
      + parent_id   = "0ay34r2gi9"
      + path        = (known after apply)
      + path_part   = "tags"
      + rest_api_id = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-09-30T18:09:45Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
        
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*